export const monthMap = {
  '01': 'січ.',
  '02': 'лют.',
  '03': 'бер.',
  '04': 'квіт.',
  '05': 'трав.',
  '06': 'черв.',
  '07': 'лип.',
  '08': 'серп.',
  '09': 'вер.',
  '10': 'жовт.',
  '11': 'лист.',
  '12': 'груд.'
};

export const countryCodes = [
  { name: 'Україна', code: '+380', pattern: /^\+380\d{9}$/ },
  { name: 'Польща', code: '+48', pattern: /^\+48\d{9}$/ },
  { name: 'Німеччина', code: '+49', pattern: /^\+49\d{10}$/ },
  { name: 'Франція', code: '+33', pattern: /^\+33\d{9}$/ },
  { name: 'Італія', code: '+39', pattern: /^\+39\d{9,10}$/ },
  { name: 'Іспанія', code: '+34', pattern: /^\+34\d{9}$/ },
  { name: 'США', code: '+1', pattern: /^\+1\d{10}$/ },
  { name: 'Канада', code: '+1', pattern: /^\+1\d{10}$/ },
  { name: 'Велика Британія', code: '+44', pattern: /^\+44\d{10}$/ },
  { name: 'Швеція', code: '+46', pattern: /^\+46\d{9}$/ },
  { name: 'Чехія', code: '+420', pattern: /^\+420\d{9}$/ },
  { name: 'Словаччина', code: '+421', pattern: /^\+421\d{9}$/ },
];